#ifndef REPEATSTRING_H
#define REPEATSTRING_H

typedef struct 
{
	int isLoop;
	size_t length;
	size_t count;
} LoopBody;

/************************************************************************/
/* 
使kmp 算法判断长度为 srcLen 的字符串 str 是否是重复的
*/
/************************************************************************/
LoopBody checkRepeatByKmp(char* str, size_t srcLen);

/************************************************************************/
/* 
长度为 len 的字符串 str 是否以 l 长度为基本单元，重复 n 次
*/
/************************************************************************/
int verifyRepeatOn(char* str, size_t len, size_t l, size_t n);

/************************************************************************/
/* 
通过质数方法检验一个长度为 len 的字符串 str 是否是重复的
*/
/************************************************************************/
LoopBody checkRepeatByPrimer(char * str, size_t len);

/************************************************************************/
/* 
使用优化后的 kmp 算法判断长度为 srcLen 的字符串 str 是否是重复的
*/
/************************************************************************/
LoopBody checkRepeatByKmpOpt(char* str, size_t srcLen);

#endif